In [13]:
import pandas as pd

# Przykład:
df1 = pd.DataFrame({
    'name': ['Ala', 'Bartek', 'Celina'],
    'age': [25, 30, 35]
}, index=[1, 2, 3])

df2 = pd.DataFrame({
    'city': ['Kraków', 'Warszawa', 'Gdańsk']
}, index=[2, 3, 4])

pd.concat([df1.reset_index(), df2.reset_index()], axis=1)

print(f'df1')
df1

df1

     name  age
1     Ala   25
2  Bartek   30
3  Celina   35

In [14]:
print(f'df2')
df2

df2

       city
2    Kraków
3  Warszawa
4    Gdańsk

In [42]:
df1.join(df2) # how='left'
# df1.join(df2, how='outer')

     name  age      city
1     Ala   25       NaN
2  Bartek   30    Kraków
3  Celina   35  Warszawa

In [17]:
df3 = pd.DataFrame({
    'name': ['Ala', 'Celina', 'Daniel'],
    'city': ['Lublin', 'Łódź', 'Poznań']
})

pd.concat([df1.reset_index(), df3.reset_index()], axis=1)

# df1.join(df3.set_index('name'), on='name')

   index    name  age  index    name    city
0      1     Ala   25      0     Ala  Lublin
1      2  Bartek   30      1  Celina    Łódź
2      3  Celina   35      2  Daniel  Poznań

In [18]:
df1.join(df3.set_index('name'), on='name')

     name  age    city
1     Ala   25  Lublin
2  Bartek   30     NaN
3  Celina   35    Łódź

In [45]:
import pandas as pd

# DF1: informacje o osobach
df1 = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Ala', 'Bartek', 'Celina', 'Daniel'],
    'age': [25, 30, 35, 40],
    'group': ['A', 'B', 'A', 'C']
})

# DF2: informacje uzupełniające (np. miasto, wynik)
df2 = pd.DataFrame({
    'id': [3, 4, 5, 6],
    'city': ['Kra', 'Waw', 'Gda', 'Wro'],
    'score': [88, 75, 91, 82],
    'group': ['A', 'C', 'B', 'A']
}, index=[1,2,3,4])

pd.concat([df1, df2], axis=1)

    id    name   age group   id city  score group
0  1.0     Ala  25.0     A  NaN  NaN    NaN   NaN
1  2.0  Bartek  30.0     B  3.0  Kra   88.0     A
2  3.0  Celina  35.0     A  4.0  Waw   75.0     C
3  4.0  Daniel  40.0     C  5.0  Gda   91.0     B
4  NaN     NaN   NaN   NaN  6.0  Wro   82.0     A

In [51]:
df1.join(df2, on='id', lsuffix='_left', rsuffix='_right') 
df1.join(df2.set_index('id'), on='id', lsuffix='_left', rsuffix='_right')

   id    name  age group_left city  score group_right
0   1     Ala   25          A  NaN    NaN         NaN
1   2  Bartek   30          B  NaN    NaN         NaN
2   3  Celina   35          A  Kra   88.0           A
3   4  Daniel   40          C  Waw   75.0           C

In [47]:
df1.join(df2, lsuffix='_left', rsuffix='_right') #default: how='left'

   id_left    name  age group_left  id_right city  score group_right
0        1     Ala   25          A       NaN  NaN    NaN         NaN
1        2  Bartek   30          B       3.0  Kra   88.0           A
2        3  Celina   35          A       4.0  Waw   75.0           C
3        4  Daniel   40          C       5.0  Gda   91.0           B

In [39]:
df2.reset_index()

   index  id city  score group
0      1   3  Kra     25     A
1      2   4  Waw     30     C
2      3   5  Gda     35     B
3      4   6  Wro    100     A